SoCXin/N32G430/src/projects/n32g430_EVAL/examples/USART/LIN/LIN_Slave/inc/main.h
/*****************************************************************************
 * Copyright (c) 2019, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/
 
/**
*\*\file main.h
*\*\author Nations
*\*\version v1.0.0
*\*\copyright Copyright (c) 2019, Nations Technologies Inc. All rights reserved.
**/
#ifndef __MAIN_H__
#define __MAIN_H__

#ifdef __cplusplus
extern "C" {
#endif

#include "n32g430.h"
#include "log.h"
#include "delay.h"
#include "lin_slave.h"

#define _USART2_COM_



#ifdef _USART2_COM_
#define USARTx              USART2
#define USARTx_CLK          RCC_APB1_PERIPH_USART2
#define USARTx_GPIO         GPIOA
#define USARTx_GPIO_CLK     RCC_AHB_PERIPH_GPIOA
#define USARTx_RxPin        GPIO_PIN_7
#define USARTx_TxPin        GPIO_PIN_6
#define USARTx_Rx_GPIO_AF   GPIO_AF11_USART2
#define USARTx_Tx_GPIO_AF   GPIO_AF11_USART2
#define GPIO_AHBClkCmd      RCC_AHB_Peripheral_Clock_Enable
#define USART_APBxClkCmd    RCC_APB1_Peripheral_Clock_Enable
#define USARTx_IRQn         USART2_IRQn
#define USARTx_IRQHandler USART2_IRQHandler
#endif


void delay_xms(uint32_t nms);
void Buffercopy(uint8_t *dest, uint8_t *src, uint16_t BufferLength);
void LIN_RespData(uint8_t *pData, uint8_t Len);
void RCC_Configuration(void);
void GPIO_Configuration(void);
void NVIC_Configuration(void);


#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H__ */
